Tekla Open API Reference for Tekla Structures 2025
AnalysisCompositeBeam Constructor
Initializes a new instance of the AnalysisCompositeBeam class
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisCompositeBeam()
Public Sub New
See Also
Reference
AnalysisCompositeBeam Class
Tekla.Structures.Analysis Namespace